CarAdvisor/app/views/operazionis/new.html.erb


<%= collection_select(:operazionis, :targa, Autoveicolo.where(user_id: current_id), :id, :get_targa) %>
---
SELECT "autoveicolos".* FROM "autoveicolos" WHERE "autoveicolos"."user_id" = ?  [["user_id", 7]]


 <%= collection_select(:operazionis, :meccanico, User.where(tipo:true), :id, :get_meccanico) %>
---
SELECT "users".* FROM "users" WHERE "users"."tipo" = ?  [["tipo", true]]