CarAdvisor/app/controllers/autoveicolos_controller.rb

  def destroy
   Autoveicolo.find(params[:id]).destroy
---
DELETE FROM "autoveicolos" WHERE "autoveicolos"."id" = ?  [["id", 1]]
SELECT  "autoveicolos".* FROM "autoveicolos" WHERE "autoveicolos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @autoveicolo=Autoveicolo.find(params[:id])
    @operazione=Operazioni.all
---
SELECT  "autoveicolos".* FROM "autoveicolos" WHERE "autoveicolos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "operazionis".* FROM "operazionis"

  def index
    @autoveicolo = Autoveicolo.all
---
SELECT "autoveicolos".* FROM "autoveicolos"

  def edit
    @autoveicolo = Autoveicolo.find(params[:id])
---
SELECT  "autoveicolos".* FROM "autoveicolos" WHERE "autoveicolos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
  #@autoveicolo = Autoveicolo.find(params[:id])
    respond_to do |format|

      if @autoveicolo.update(auto_params)
---
UPDATE "autoveicolos" SET "targa" = ?, "modello" = ?, "carburante" = ?, "kilometri" = ?, "updated_at" = ? WHERE "autoveicolos"."id" = ?  [["targa", "xvxvx"], ["modello", "cvcxvx"], ["carburante", "Benzina"], ["kilometri", 43535.0], ["updated_at", 2017-04-13 14:40:55 UTC], ["id", 1]]

  def create
    @autoveicolo = Autoveicolo.new(auto_params)
    respond_to do |format|
     if @autoveicolo.save
---
INSERT INTO "autoveicolos" ("user_id", "targa", "modello", "carburante", "kilometri", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["targa", "431312"], ["modello", "3123123"], ["carburante", "Diesel"], ["kilometri", 123132.0], ["created_at", 2017-04-07 12:44:56 UTC], ["updated_at", 2017-04-07 12:44:56 UTC]]

   def find_user
      ret = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]