CarAdvisor/app/controllers/officinas_controller.rb

  def show
	@officina=Officina.find(params[:id])
---
SELECT  "officinas".* FROM "officinas" WHERE "officinas"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def destroy
	 Officina.find(params[:id]).destroy
---
DELETE FROM "officinas" WHERE "officinas"."id" = ?  [["id", 3]]
SELECT  "officinas".* FROM "officinas" WHERE "officinas"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def edit
	@officina=Officina.find(params[:id])
---
SELECT  "officinas".* FROM "officinas" WHERE "officinas"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

   def new
   @officina=Officina.new
   @user=User.all
---
SELECT "users".* FROM "users"

  def index
	@officina=Officina.all
---
SELECT "officinas".* FROM "officinas"

def update
  @officina = Officina.find(params[:id])
    respond_to do |format|

      if @officina.update(officina_params)
---
SELECT  "officinas".* FROM "officinas" WHERE "officinas"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "officinas" SET "indirizzo" = ?, "contatto" = ?, "numero_telefono" = ?, "updated_at" = ? WHERE "officinas"."id" = ?  [["indirizzo", ""], ["contatto", "cknewlheliwch"], ["numero_telefono", "12341324"], ["updated_at", 2017-04-15 13:05:24 UTC], ["id", 4]]

  def create
    @officina = Officina.new(officina_params)
    respond_to do |format|
     if @officina.save
---
INSERT INTO "officinas" ("user_id", "indirizzo", "contatto", "numero_telefono", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 3], ["indirizzo", "via bedelli 23"], ["contatto", "ifkfs"], ["numero_telefono", "4445557896"], ["created_at", 2017-04-15 10:58:23 UTC], ["updated_at", 2017-04-15 10:58:23 UTC]]