CarAdvisor/app/controllers/operazionis_controller.rb

  def new
   @operazioni=Operazioni.new
   @user=User.all
   @autoveicolo= Autoveicolo.all
---
SELECT "autoveicolos".* FROM "autoveicolos"

  def show
     @operazioni=Operazioni.find(params[:id])
---
SELECT  "operazionis".* FROM "operazionis" WHERE "operazionis"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def edit
	@user=User.all

	@operazioni=Operazioni.find(params[:id])
---
SELECT  "operazionis".* FROM "operazionis" WHERE "operazionis"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
      @operazioni = Operazioni.new(operazioni_params)
        respond_to do |format|
          if @operazioni.save
---
INSERT INTO "operazionis" ("user_id", "km", "oggetto", "meccanico", "created_at", "updated_at", "targa", "costo") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["user_id", 7], ["km", 111.0], ["oggetto", "ocd"], ["meccanico", "4"], ["created_at", 2017-04-23 16:32:27 UTC], ["updated_at", 2017-04-23 16:32:27 UTC], ["targa", "12"], ["costo", 222.0]]

  def destroy

    Operazioni.find(params[:id]).destroy
---
DELETE FROM "operazionis" WHERE "operazionis"."id" = ?  [["id", 1]]
SELECT  "operazionis".* FROM "operazionis" WHERE "operazionis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
   @operazioni=Operazioni.find(params[:id])
---
SELECT  "operazionis".* FROM "operazionis" WHERE "operazionis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]