CarAdvisor/app/controllers/password_resets_controller.rb

  def update
    if password_blank?
      flash.now[:danger] = "Password can't be blank"
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$fiDA4JfJBBjMPnk9s.83le.BFbQXiHp0q5Ae2cMsuqGMETI2PXL3e"], ["updated_at", 2017-04-04 00:13:12 UTC], ["id", 16]]