CarAdvisor/app/controllers/users_controller.rb

INSERT INTO "users" ("nome", "cognome", "email", "tipo", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|

      if @user.save

UPDATE "users" SET "cognome" = ?, "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["cognome", "falesiedi"], ["email", "mecc@gomme.it"], ["password_digest", "$2a$10$dBYOLcJY01qIlJ4Jbugh8uEaRdqSb517UaThorgluoLheGPPXvgMa"], ["updated_at", 2017-04-18 17:11:00 UTC], ["id", 4]]
---
  def update
    respond_to do |format|


      if @user.update(user_params)